In [27]:
from jqdatasdk import *
import pandas as pd

In [4]:
auth('15918636606', 'Ucb16697')

auth success

In [29]:
df1 = get_price('TC9999.XZCE', start_date='2013-09-27', end_date='2016-03-08', frequency='daily', fields=['open', 'close'])

In [30]:
df1.drop_duplicates()

             open  close
2013-09-27  535.8  546.6
2013-09-30  545.0  555.0
2013-10-08  555.0  547.4
2013-10-09  546.4  547.0
2013-10-10  545.6  547.4
...           ...    ...
2016-02-23  308.2  308.2
2016-02-26  320.4  320.4
2016-03-03  313.0  313.0
2016-03-04  313.2  313.2
2016-03-08  322.0  322.0

[566 rows x 2 columns]

In [34]:
df2 = get_price('ZC9999.XZCE', start_date='2020-05-15', end_date='2020-05-19', frequency='daily', fields=['open', 'close'])

In [35]:
df2.drop_duplicates()

             open  close
2020-05-15  526.2  522.4
2020-05-18  524.0  531.6
2020-05-19  534.6  539.8

In [33]:
pd.concat([df1,df2])

             open  close
2013-09-27  535.8  546.6
2013-09-30  545.0  555.0
2013-10-08  555.0  547.4
2013-10-09  546.4  547.0
2013-10-10  545.6  547.4
...           ...    ...
2020-12-14  742.2  730.2
2020-12-15  730.0  721.0
2020-12-16  719.8  714.8
2020-12-17  674.8  689.8
2020-12-18  693.2  707.4

[1761 rows x 2 columns]